app/views/recipes/_reviews.html.erb

    <b>  <% arr = [] %>
      <%if @recipe.reviews.size != 0 %>
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 1]]