app/views/recipes/index.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 1]]
---
            <% arr = [] %>
            <%if recipe.reviews.size != 0 %>